---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelSketchProjection
source: html/eeb6dfa1-df07-5c85-b6b2-31be124b3c07.htm
---
# Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelSketchProjection Property

"In-Plane Projection"

## Syntax (C#)
```csharp
public static ForgeTypeId AnalyticalModelSketchProjection { get; }
```